Tekla.Structures.DirectManipulation.Adapter.Session.ObjectJsonConverter
The Tekla.Structures.DirectManipulation.Adapter.Session.ObjectJsonConverter supports JSON converter for the System.Object type.

Tekla.Structures.DirectManipulation.Adapter.Session.ObjectJsonConverter.SupportedTypes
Gets the supported types.

Tekla.Structures.DirectManipulation.Adapter.Session.ObjectJsonConverter.ReadJson(Newtonsoft.Json.JsonReader,System.Type,System.Object,Newtonsoft.Json.JsonSerializer)
Reads the JSON representation of the object.
reader: The Newtonsoft.Json.JsonReader to read from.
objectType: Type of the object.
existingValue: The existing value of object being read.
serializer: The calling serializer.
Returns: The object value.